src_doc/InformationRegisters/ДескрипторыДляОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДескрипторыДляОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолученОт</Name>
					<Comment>Все типы из измерения "Объект", плюс Предмет из справочника "ЗаписиРабочегоКалендаря"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕженедельныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеАдресаты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструкции</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.СпискиРассылкиПоКонтрагентам</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыгрузкаВССТУ</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранспортныйКонтейнерЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаписиРабочегоКалендаря</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыНоменклатурыДел</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Отсутствие</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщенияОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.Резолюции</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаметкиДокументооборота</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныГруппКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФорума</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.ВизыСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтрольныеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаДелВАрхив</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиМероприятий</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УничтожениеДел</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЗадач</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектДоступа</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дескриптор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДескрипторыДоступаОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДескриптора</Name>
					<Comment>0 - основной; 1 - по рабочей группе; 2 - индивидуальный; 3 - от владельца; 4 - для локальных администраторов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ДескрипторыДляОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет наличие в регистре записей по дескриптору.
//
// Параметры:
//  ДескрипторСсылка - СправочникСсылка - ссылка на дескриптор.
//
// Возвращаемое значение:
//  Булево - Истина, если найдена хотя бы одна запись.
//
Функция ЕстьЗаписиПоДескриптору(ДескрипторСсылка) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
		|ГДЕ
		|	ДескрипторыДляОбъектов.Дескриптор = &Дескриптор");
	
	Запрос.УстановитьПараметр("Дескриптор", ДескрипторСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#Область КонстантыТиповДескрипторов

// Блок функций, возвращающих числовые коды соответствующих типов дескрипторов объектов.

// Тип дескриптора - основной.
// 
// Возвращаемое значение:
//  Число
Функция ТипОсновной() Экспорт
	
	Возврат 0;
	
КонецФункции

// Тип дескриптора - по рабочей группе.
// 
// Возвращаемое значение:
//  Число
Функция ТипПоРабочейГруппе() Экспорт
	
	Возврат 1;
	
КонецФункции

// Тип дескриптора - индивидуальный.
// 
// Возвращаемое значение:
//  Число
Функция ТипИндивидуальный() Экспорт
	
	Возврат 2;
	
КонецФункции

// Тип дескриптора - от владельца.
// 
// Возвращаемое значение:
//  Число
Функция ТипОтВладельца() Экспорт
	
	Возврат 3;
	
КонецФункции

// Тип дескриптора - для локальных администраторов.
// 
// Возвращаемое значение:
//  Число
Функция ТипДляЛокальныхАдминов() Экспорт
	
	Возврат 4;
	
КонецФункции

#КонецОбласти // КонстантыТиповДескрипторов

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Сохраняет соответствие объекта доступа и его дескрипторов
// 
// Параметры:
//  ТаблицаДескрипторов - ТаблицаЗначений - таблица, содержащая данные для записи в регистр.
//  ОбъектДоступа - ЛюбаяСсылка - ссылка на объект, чьи дескрипторы нужно записать.
//  ОпределятьЗависимыеПрава - Булево - признак необходимости обновления зависимых прав.
//  ЭтоНовый - Булево - Признак, что объект новый. Для оптимизации, чтобы не проверять на существование дескрипторов.
// 
Процедура Сохранить(ТаблицаДескрипторов, ОбъектДоступа, ОпределятьЗависимыеПрава = Истина, ЭтоНовый = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаДескрипторов.Свернуть("Объект, Дескриптор, ОбъектМетаданных, ТипДескриптора, ПолученОт");
	
	// Новые дескрипторы записываются в базу только если есть отличия от старых.
	ЕстьОтличия = Истина;
	Если Не ЭтоНовый Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	НовыеДескрипторы.Дескриптор,
			|	НовыеДескрипторы.ТипДескриптора,
			|	НовыеДескрипторы.ПолученОт
			|ПОМЕСТИТЬ НовыеДескрипторы
			|ИЗ
			|	&НовыеДескрипторы КАК НовыеДескрипторы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДескрипторыДляОбъектов.Дескриптор,
			|	ДескрипторыДляОбъектов.ТипДескриптора,
			|	ДескрипторыДляОбъектов.ПолученОт
			|ПОМЕСТИТЬ СтарыеДескрипторы
			|ИЗ
			|	РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
			|ГДЕ
			|	ДескрипторыДляОбъектов.Объект = &Объект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьОтличия
			|ИЗ
			|	СтарыеДескрипторы КАК СтарыеДескрипторы
			|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеДескрипторы КАК НовыеДескрипторы
			|		ПО СтарыеДескрипторы.Дескриптор = НовыеДескрипторы.Дескриптор
			|			И СтарыеДескрипторы.ТипДескриптора = НовыеДескрипторы.ТипДескриптора
			|			И СтарыеДескрипторы.ПолученОт = НовыеДескрипторы.ПолученОт
			|ГДЕ
			|	НовыеДескрипторы.Дескриптор ЕСТЬ NULL 
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА
			|ИЗ
			|	НовыеДескрипторы КАК НовыеДескрипторы
			|		ЛЕВОЕ СОЕДИНЕНИЕ СтарыеДескрипторы КАК СтарыеДескрипторы
			|		ПО СтарыеДескрипторы.Дескриптор = НовыеДескрипторы.Дескриптор
			|			И СтарыеДескрипторы.ТипДескриптора = НовыеДескрипторы.ТипДескриптора
			|			И СтарыеДескрипторы.ПолученОт = НовыеДескрипторы.ПолученОт
			|ГДЕ
			|	СтарыеДескрипторы.Дескриптор ЕСТЬ NULL ");
		
		Запрос.УстановитьПараметр("Объект", ОбъектДоступа);
		Запрос.УстановитьПараметр("НовыеДескрипторы", ТаблицаДескрипторов);
		
		ЕстьОтличия = Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Если ЕстьОтличия Тогда
		
		ТаблицаДескрипторов.ЗаполнитьЗначения(ОбъектДоступа, "Объект");
		ТаблицаДескрипторов.ЗаполнитьЗначения(
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектДоступа.Метаданные()), "ОбъектМетаданных");
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(ОбъектДоступа);
		Набор.Загрузить(ТаблицаДескрипторов);
		
		Если Не ОпределятьЗависимыеПрава Тогда
			Набор.ДополнительныеСвойства.Вставить("ПропуститьОпределениеЗависимыхПрав", Истина);
		КонецЕсли;
		
		Набор.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет соответствие объекта доступа и его основного дескриптора
// 
// Параметры:
//  Дескриптор - СправочникСсылка.ДескрипторыДоступаОбъектов
//  ОбъектДоступа - ОпределяемыйТип.ОбъектДоступа - ссылка на объект, чьи дескрипторы нужно записать.
//  ОпределятьЗависимыеПрава - Булево - признак необходимости обновления зависимых прав.
// 
Процедура СохранитьОсновнойДескриптор(Дескриптор, ОбъектДоступа, ОпределятьЗависимыеПрава = Истина) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДескрипторыДляОбъектов.Дескриптор
		|ИЗ
		|	РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
		|ГДЕ
		|	ДескрипторыДляОбъектов.Объект = &ОбъектДоступа
		|	И ДескрипторыДляОбъектов.ТипДескриптора = &ТипОсновной");
	Запрос.УстановитьПараметр("ТипОсновной", ТипОсновной());
	Запрос.УстановитьПараметр("ОбъектДоступа", ОбъектДоступа);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтарыйДескриптор = Неопределено;
	
	Если Выборка.Следующий() Тогда
		СтарыйДескриптор = Выборка.Дескриптор;
	КонецЕсли;
	
	Если СтарыйДескриптор <> Дескриптор Тогда
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(ОбъектДоступа);
		НаборЗаписей.Отбор.ТипДескриптора.Установить(ТипОсновной());
		
		Строка = НаборЗаписей.Добавить();
		Строка.Объект = ОбъектДоступа;
		Строка.Дескриптор = Дескриптор;
		Строка.ОбъектМетаданных = 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Дескриптор, "ИдентификаторОбъектаМетаданных");
		Строка.ТипДескриптора = ТипОсновной();
		
		Если Не ОпределятьЗависимыеПрава Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьОпределениеЗависимыхПрав", Истина);
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает массив дескрипторов, которые назначены объекту.
// 
// Параметры:
//  ОбъектДоступа - ОпределяемыйТип.ОбъектДоступа - Ссылка на объект, чьи дескрипторы нужно получить.
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.ДескрипторыДоступаОбъектов - массив дескрипторов объекта.
// 
Функция ПолучитьДескрипторыОбъекта(ОбъектДоступа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДескрипторыДляОбъектов.Дескриптор
		|ИЗ
		|	РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
		|ГДЕ
		|	ДескрипторыДляОбъектов.Объект = &ОбъектДоступа";
	
	Запрос.УстановитьПараметр("ОбъектДоступа", ОбъектДоступа);
	Дескрипторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Дескриптор");
	
	Возврат Дескрипторы;
	
КонецФункции

// Проверяет наличие дескрипторов для объекта.
// 
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект.
//  ОтборПоТипу - Число, Неопределено - тип дескрипторов, которые нужно получить. Если Неопределено, то все.
// 
// Возвращаемое значение:
//  Булево - Истина, если дескрипторы найдены.
// 
Функция ЕстьДескрипторыОбъекта(СсылкаНаОбъект, ОтборПоТипу = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
		|ГДЕ
		|	ДескрипторыДляОбъектов.Объект = &СсылкаНаОбъект
		|	И &ДопУсловия");
	
	ДопУсловия = "ИСТИНА";
	Если ОтборПоТипу <> Неопределено Тогда
		ДопУсловия = "ДескрипторыДляОбъектов.ТипДескриптора = &ОтборПоТипу";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловия", ДопУсловия);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ОтборПоТипу", ОтборПоТипу);
	
	ЕстьЗаписи = Не Запрос.Выполнить().Пустой();
	
	Возврат ЕстьЗаписи;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#КонецЕсли
